TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1106/driverlib/empty_driverlib_src/ti/driverlib/dl_dma.h
/** @addtogroup DL_DMA_EVENT
 *  @{
 */
/*!
 * @brief DMA channel 0 interrupt
 */
#define DL_DMA_EVENT_CHANNEL0                             (DMA_GEN_EVENT_IMASK_DMACH0_SET)

/*!
 * @brief DMA channel 1 interrupt
 */
#define DL_DMA_EVENT_CHANNEL1                             (DMA_GEN_EVENT_IMASK_DMACH1_SET)

/*!
 * @brief DMA channel 2 interrupt
 */
#define DL_DMA_EVENT_CHANNEL2                             (DMA_GEN_EVENT_IMASK_DMACH2_SET)

/*!
 * @brief DMA channel 3 interrupt
 */
#define DL_DMA_EVENT_CHANNEL3                             (DMA_GEN_EVENT_IMASK_DMACH3_SET)

/*!
 * @brief DMA channel 4 interrupt
 */
#define DL_DMA_EVENT_CHANNEL4                             (DMA_GEN_EVENT_IMASK_DMACH4_SET)

/*!
 * @brief DMA channel 5 interrupt
 */
#define DL_DMA_EVENT_CHANNEL5                             (DMA_GEN_EVENT_IMASK_DMACH5_SET)

/*!
 * @brief DMA channel 6 interrupt
 */
#define DL_DMA_EVENT_CHANNEL6                             (DMA_GEN_EVENT_IMASK_DMACH6_SET)

/*!
 * @brief DMA channel 7 interrupt
 */
#define DL_DMA_EVENT_CHANNEL7                             (DMA_GEN_EVENT_IMASK_DMACH7_SET)

/*!
 * @brief DMA channel 8 interrupt
 */
#define DL_DMA_EVENT_CHANNEL8                             (DMA_GEN_EVENT_IMASK_DMACH8_SET)

/*!
 * @brief DMA channel 9 interrupt
 */
#define DL_DMA_EVENT_CHANNEL9                             (DMA_GEN_EVENT_IMASK_DMACH9_SET)

/*!
 * @brief DMA channel 10 interrupt
 */
#define DL_DMA_EVENT_CHANNEL10                           (DMA_GEN_EVENT_IMASK_DMACH10_SET)

/*!
 * @brief DMA channel 12 interrupt
 */
#define DL_DMA_EVENT_CHANNEL12                           (DMA_GEN_EVENT_IMASK_DMACH12_SET)

/*!
 * @brief DMA channel 13 interrupt
 */
#define DL_DMA_EVENT_CHANNEL13                           (DMA_GEN_EVENT_IMASK_DMACH13_SET)

/*!
 * @brief DMA channel 14 interrupt
 */
#define DL_DMA_EVENT_CHANNEL14                           (DMA_GEN_EVENT_IMASK_DMACH14_SET)

/*!
 * @brief DMA channel 15 interrupt
 */
#define DL_DMA_EVENT_CHANNEL15                           (DMA_GEN_EVENT_IMASK_DMACH15_SET)

#ifdef DEVICE_HAS_DMA_FULL_CHANNEL
/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 0 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL0            (DMA_GEN_EVENT_IMASK_PREIRQCH0_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 1 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL1            (DMA_GEN_EVENT_IMASK_PREIRQCH1_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 2 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL2            (DMA_GEN_EVENT_IMASK_PREIRQCH2_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 3 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL3            (DMA_GEN_EVENT_IMASK_PREIRQCH3_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 4 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL4            (DMA_GEN_EVENT_IMASK_PREIRQCH4_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 5 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL5            (DMA_GEN_EVENT_IMASK_PREIRQCH5_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 6 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL6            (DMA_GEN_EVENT_IMASK_PREIRQCH6_SET)

/*!
 * @brief Available for FULL-channel configuration only. Early IRQ for DMA
 * channel 7 interrupt. Size counter has reached early IRQ threshold.
 */
#define DL_DMA_FULL_CH_EVENT_EARLY_CHANNEL7            (DMA_GEN_EVENT_IMASK_PREIRQCH7_SET)
#endif /* DEVICE_HAS_DMA_FULL_CHANNEL */

/*!
 * @brief DMA address error, source address not reachable
 */
#define DL_DMA_EVENT_ADDR_ERROR                     (DMA_GEN_EVENT_IMASK_ADDRERR_SET)
/*!
 * @brief DMA data error, source data might be corrupted (PAR or ECC error)
 */
#define DL_DMA_EVENT_DATA_ERROR                     (DMA_GEN_EVENT_IMASK_DATAERR_SET)

/** @}*/

/*! @enum DL_DMA_TRANSFER_MODE */
typedef enum {
    /*! Each DMA trigger results in a single data transfer, once */
    DL_DMA_SINGLE_TRANSFER_MODE = DMA_DMACTL_DMATM_SINGLE,
    /*! Each DMA trigger results in a transfer of a block of data, once */
    DL_DMA_SINGLE_BLOCK_TRANSFER_MODE = DMA_DMACTL_DMATM_BLOCK,
#ifdef DEVICE_HAS_DMA_FULL_CHANNEL
    /*! Available for FULL-channel configuration only. Each DMA trigger results
     *  in a single data transfer, repeating */
    DL_DMA_FULL_CH_REPEAT_SINGLE_TRANSFER_MODE = DMA_DMACTL_DMATM_RPTSNGL,
    /*! Available for FULL-channel configuration only. Each DMA trigger results
     *  in a transfer of a block of data, repeating */
    DL_DMA_FULL_CH_REPEAT_BLOCK_TRANSFER_MODE = DMA_DMACTL_DMATM_RPTBLCK,
#endif /* DEVICE_HAS_DMA_FULL_CHANNEL */
} DL_DMA_TRANSFER_MODE;

/*! @enum DL_DMA_EXTENDED_MODE */
typedef enum {
    /*! Normal operation */
    DL_DMA_NORMAL_MODE = DMA_DMACTL_DMAEM_NORMAL,
#ifdef DEVICE_HAS_DMA_FULL_CHANNEL
#ifdef DEVICE_HAS_AUTO_AND_GATHER
    /*! Available for FULL-channel configuration only. Reads data from
     *  address table located at source address and transfers data to
     *  destination address */
    DL_DMA_FULL_CH_GATHER_MODE = DMA_DMACTL_DMAEM_GATHERMODE,
#endif /* DEVICE_HAS_AUTO_AND_GATHER */
    /*! Available for FULL-channel configuration only. Fills the destination
     *  with a specific value */
    DL_DMA_FULL_CH_FILL_MODE = DMA_DMACTL_DMAEM_FILLMODE,
    /*! Available for FULL-channel configuration only. The source data contains
     *  addresses and data */
    DL_DMA_FULL_CH_TABLE_MODE = DMA_DMACTL_DMAEM_TABLEMODE,
#endif /* DEVICE_HAS_DMA_FULL_CHANNEL */
} DL_DMA_EXTENDED_MODE;

/*! @enum DL_DMA_INCREMENT */
typedef enum {
    /*! Do not change address after each transfer */
    DL_DMA_ADDR_UNCHANGED = DMA_DMACTL_DMASRCINCR_UNCHANGED,
    /*! Decrement address by 1 * DL_DMA_WIDTH after each transfer */
    DL_DMA_ADDR_DECREMENT = DMA_DMACTL_DMASRCINCR_DECREMENT,
    /*! Increment address by 1 * DL_DMA_WIDTH after each transfer */
    DL_DMA_ADDR_INCREMENT = DMA_DMACTL_DMASRCINCR_INCREMENT,
    /*! Stride mode 2, increment address by 2 * DL_DMA_WIDTH (skip over every
     * other element) */
    DL_DMA_ADDR_STRIDE_2 = DMA_DMACTL_DMASRCINCR_STRIDE_2,
    /*! Stride mode 3, increment address by 3 * DL_DMA_WIDTH (skip over two
     * elements */
    DL_DMA_ADDR_STRIDE_3 = DMA_DMACTL_DMASRCINCR_STRIDE_3,
    /*! Stride mode 4, increment address by 4 * DL_DMA_WIDTH (skip over three
     * elements */
    DL_DMA_ADDR_STRIDE_4 = DMA_DMACTL_DMASRCINCR_STRIDE_4,
    /*! Stride mode 5, increment address by 5 * DL_DMA_WIDTH (skip over four
     * elements */
    DL_DMA_ADDR_STRIDE_5 = DMA_DMACTL_DMASRCINCR_STRIDE_5,
    /*! Stride mode 6, increment address by 6 * DL_DMA_WIDTH (skip over five
     * elements */
    DL_DMA_ADDR_STRIDE_6 = DMA_DMACTL_DMASRCINCR_STRIDE_6,
    /*! Stride mode 7, increment address by 7 * DL_DMA_WIDTH (skip over six
     * elements */
    DL_DMA_ADDR_STRIDE_7 = DMA_DMACTL_DMASRCINCR_STRIDE_7,
    /*! Stride mode 8, increment address by 8 * DL_DMA_WIDTH (skip over seven
     * elements */
    DL_DMA_ADDR_STRIDE_8 = DMA_DMACTL_DMASRCINCR_STRIDE_8,
    /*! Stride mode 9, increment address by 9 * DL_DMA_WIDTH (skip over eight
     * elements */
    DL_DMA_ADDR_STRIDE_9 = DMA_DMACTL_DMASRCINCR_STRIDE_9,
} DL_DMA_INCREMENT;

/*! @enum DL_DMA_EARLY_INTERRUPT_THRESHOLD */
typedef enum {
    /*! Disable early interrupt events */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_DISABLED = DMA_DMACTL_DMAPREIRQ_PREIRQ_DISABLE,
    /*! Generate Early-IRQ event with one transfer pending (DMASZ=1) */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_1 = DMA_DMACTL_DMAPREIRQ_PREIRQ_1,
    /*! Generate Early-IRQ event with two transfers pending (DMASZ=2) */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_2 = DMA_DMACTL_DMAPREIRQ_PREIRQ_2,
    /*! Generate Early-IRQ event with three transfers pending (DMASZ=4) */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_4 = DMA_DMACTL_DMAPREIRQ_PREIRQ_4,
    /*! Generate Early-IRQ event with eight transfers pending (DMASZ=8) */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_8 = DMA_DMACTL_DMAPREIRQ_PREIRQ_8,
    /*! Generate Early-IRQ event with 32 transfers pending (DMASZ=32) */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_32 = DMA_DMACTL_DMAPREIRQ_PREIRQ_32,
    /*! Generate Early-IRQ event with 64 transfers pending (DMASZ=64) */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_64 = DMA_DMACTL_DMAPREIRQ_PREIRQ_64,
    /*! Generate Early-IRQ event when DMASZ reaches the half size point of the
     * original transfer size */
    DL_DMA_EARLY_INTERRUPT_THRESHOLD_HALF = DMA_DMACTL_DMAPREIRQ_PREIRQ_HALF,
} DL_DMA_EARLY_INTERRUPT_THRESHOLD;

/*! @enum DL_DMA_BURST_SIZE */
typedef enum {
    /*! No burst interruption. The block transfer always transfers all elements
     * defined in the DMASZ register before priority is newly evaluated */
    DL_DMA_BURST_SIZE_INFINITY = DMA_DMAPRIO_BURSTSZ_INFINITI,
    /*! Burst size of a block transfer is 8 */
    DL_DMA_BURST_SIZE_8 = DMA_DMAPRIO_BURSTSZ_BURST_8,
    /*! Burst size of a block transfer is 16 */
    DL_DMA_BURST_SIZE_16 = DMA_DMAPRIO_BURSTSZ_BUSRT_16,
    /*! Burst size of a block transfer is 32 */
    DL_DMA_BURST_SIZE_32 = DMA_DMAPRIO_BURSTSZ_BURST_32,
} DL_DMA_BURST_SIZE;

/*! @enum DL_DMA_TRIGGER_TYPE */
typedef enum {
    /*! Internal DMA channel is selected as the DMA trigger */
    DL_DMA_TRIGGER_TYPE_INTERNAL = DMA_DMATCTL_DMATINT_INTERNAL,
    /*! External DMA channel is selected as the DMA trigger */
    DL_DMA_TRIGGER_TYPE_EXTERNAL = DMA_DMATCTL_DMATINT_EXTERNAL,
} DL_DMA_TRIGGER_TYPE;

