TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1106/driverlib/empty_driverlib_src/ti/driverlib/dl_dma.h
/*! @enum DL_DMA_WIDTH */
typedef enum {
    /*! Byte Acccess (8-bit) */
    DL_DMA_WIDTH_BYTE = DMA_DMACTL_DMASRCWDTH_BYTE,
    /*! Half Word Acccess (16-bit) */
    DL_DMA_WIDTH_HALF_WORD = DMA_DMACTL_DMASRCWDTH_HALF,
    /*! Word Acccess (32-bit) */
    DL_DMA_WIDTH_WORD = DMA_DMACTL_DMASRCWDTH_WORD,
    /*! Long Acccess (64-bit) */
    DL_DMA_WIDTH_LONG = DMA_DMACTL_DMASRCWDTH_LONG,
    #ifdef DEVICE_HAS_LLONG_ACCESS
    /*! Long-long Acccess (128-bit) */
    DL_DMA_WIDTH_LONG_LONG = DMA_DMACTL_DMASRCWDTH_LONGLONG,
    #endif /* DEVICE_HAS_LLONG_ACCESS*/
} DL_DMA_WIDTH;

/*! @enum DL_DMA_EVENT_IIDX */
typedef enum {
    /*! Enum to indicate that no DMA event has taken place */
    DL_DMA_EVENT_IIDX_NO_INTR = DMA_GEN_EVENT_IIDX_STAT_NO_INTR,
    /*! Enum to indicate that the channel 0 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH0 = DMA_GEN_EVENT_IIDX_STAT_DMACH0,
    /*! Enum to indicate that the channel 1 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH1 = DMA_GEN_EVENT_IIDX_STAT_DMACH1,
    /*! Enum to indicate that the channel 2 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH2 = DMA_GEN_EVENT_IIDX_STAT_DMACH2,
    /*! Enum to indicate that the channel 3 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH3 = DMA_GEN_EVENT_IIDX_STAT_DMACH3,
    /*! Enum to indicate that the channel 4 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH4 = DMA_GEN_EVENT_IIDX_STAT_DMACH4,
    /*! Enum to indicate that the channel 5 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH5 = DMA_GEN_EVENT_IIDX_STAT_DMACH5,
    /*! Enum to indicate that the channel 6 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH6 = DMA_GEN_EVENT_IIDX_STAT_DMACH6,
    /*! Enum to indicate that the channel 7 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH7 = DMA_GEN_EVENT_IIDX_STAT_DMACH7,
    /*! Enum to indicate that the channel 8 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH8 = DMA_GEN_EVENT_IIDX_STAT_DMACH8,
    /*! Enum to indicate that the channel 9 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH9 = DMA_GEN_EVENT_IIDX_STAT_DMACH9,
    /*! Enum to indicate that the channel 10 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH10 = DMA_GEN_EVENT_IIDX_STAT_DMACH10,
    /*! Enum to indicate that the channel 11 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH11 = DMA_GEN_EVENT_IIDX_STAT_DMACH11,
    /*! Enum to indicate that the channel 12 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH12 = DMA_GEN_EVENT_IIDX_STAT_DMACH12,
    /*! Enum to indicate that the channel 13 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH13 = DMA_GEN_EVENT_IIDX_STAT_DMACH13,
    /*! Enum to indicate that the channel 14 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH14 = DMA_GEN_EVENT_IIDX_STAT_DMACH14,
    /*! Enum to indicate that the channel 15 interrupt has fired */
    DL_DMA_EVENT_IIDX_DMACH15 = DMA_GEN_EVENT_IIDX_STAT_DMACH15,
#ifdef DEVICE_HAS_DMA_FULL_CHANNEL
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 0 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH0 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH0,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 1 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH1 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH1,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 2 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH2 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH2,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 3 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH3 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH3,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 4 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH4 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH4,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 5 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH5 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH5,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 6 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH6 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH6,
    /*! Available for FULL-channel configuration only. Enum to indicate that the
     *  early interrupt event for channel 7 interrupt has fired */
    DL_DMA_FULL_CH_EVENT_IIDX_EARLY_IRQ_DMACH7 = DMA_GEN_EVENT_IIDX_STAT_PREIRQCH7,
#endif /* DEVICE_HAS_DMA_FULL_CHANNEL */
    /*! Enum to indicate that a DMA address error has occurred */
    DL_DMA_EVENT_IIDX_ADDR_ERROR = DMA_GEN_EVENT_IIDX_STAT_ADDRERR,

    /*! Enum to indicate that a DMA data error has occurred */
    DL_DMA_EVENT_IIDX_DATA_ERROR = DMA_GEN_EVENT_IIDX_STAT_DATAERR
} DL_DMA_EVENT_IIDX;

/*! @enum DL_DMA_PUBLISHER_INDEX */
typedef enum {
    /*! DMA Publisher index 0 */
    DL_DMA_PUBLISHER_INDEX_0 = 0,
} DL_DMA_PUBLISHER_INDEX;

/*! @enum DL_DMA_SUBSCRIBER_INDEX */
typedef enum {
    /*! DMA Subscriber index 0 */
    DL_DMA_SUBSCRIBER_INDEX_0 = 0,
    /*! DMA Subscriber index 1 */
    DL_DMA_SUBSCRIBER_INDEX_1 = 1
} DL_DMA_SUBSCRIBER_INDEX;

/*! @enum DL_DMA_AUTOEN */
typedef enum {
    /*! No automatic DMA enable */
    DL_DMA_AUTOEN_DISABLE = DMA_DMACTL_DMAAUTOEN_DISABLE,
    #ifdef DEVICE_HAS_AUTO_AND_GATHER
    /*! Automatic DMA enable on DMASA register write */
    DL_DMA_AUTOEN_DMASA = DMA_DMACTL_DMAAUTOEN_DMASA,
    /*! Automatic DMA enable on DMADA register write */
    DL_DMA_AUTOEN_DMADA = DMA_DMACTL_DMAAUTOEN_DMADA,
    /*! Automatic DMA enable on DMASZ register write */
    DL_DMA_AUTOEN_DMASZ = DMA_DMACTL_DMAAUTOEN_DMASZ,
    #endif /* DEVICE_HAS_AUTO_AND_GATHER*/
} DL_DMA_AUTOEN;

/* clang-format on */

/*!
 *  @brief Configuration struct for @ref DL_DMA_initChannel.
 */
typedef struct {
    /*!
     *  The event that should trigger a DMA transfer. Refer to the datasheet of
     *  the device for which DMA trigger values map to which events.
     */
    uint8_t trigger;

    /*!
     *  Configure whether the DMA selects an internal or external channel as
     *  the DMA trigger
     */
    DL_DMA_TRIGGER_TYPE triggerType;

    /*!
     * The transfer mode to use. Refer to the device datasheet to determine
     * which modes are supported in the selected channel.
     * One of @ref DL_DMA_TRANSFER_MODE.
     */
    DL_DMA_TRANSFER_MODE transferMode;

