TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1106/driverlib/empty_driverlib_src/ti/driverlib/dl_dma.h
    /*! The extended mode to use. One of @ref DL_DMA_EXTENDED_MODE. */
    DL_DMA_EXTENDED_MODE extendedMode;

    /*! The width of the DMA source. One of @ref DL_DMA_WIDTH. */
    DL_DMA_WIDTH srcWidth;

    /*! The width of the DMA destination. One of @ref DL_DMA_WIDTH. */
    DL_DMA_WIDTH destWidth;

    /*!
     *  Amount to increment/decrement the DMA source address by. One of
     *  @ref DL_DMA_INCREMENT.
     */
    DL_DMA_INCREMENT srcIncrement;

    /*!
     *  Amount to increment/decrement the DMA destination address by. One of
     *  @ref DL_DMA_INCREMENT.
     */
    DL_DMA_INCREMENT destIncrement;
} DL_DMA_Config;

/**
 *  @brief      Initialize a DMA channel
 *
 *  Initializes all the configurable options for a DMA channel. The DMA channel
 *  is not enabled in this API.
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *  @param[in]  config        Pointer to DMA channel configuration settings
 */
void DL_DMA_initChannel(
    DMA_Regs *dma, uint8_t channelNum, const DL_DMA_Config *config);

/**
 *  @brief      Configure a DMA channel for a transfer
 *
 *  Configures the transfer settings for a DMA channel. The DMA channel is
 *  not enabled in this API.
 *
 *  @param[in]  dma             Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum      DMA channel to operate on
 *  @param[in]  transferMode    The transfer mode to use. Refer to the device
 *                              datasheet to determine which modes are supported
 *                              in the selected channel. One of
 *                              @ref DL_DMA_TRANSFER_MODE.
 *  @param[in]  extendedMode    The extended mode to use. One of
 *                              @ref DL_DMA_EXTENDED_MODE.
 *  @param[in]  srcWidth        The width of the DMA source. One of
 *                              @ref DL_DMA_WIDTH.
 *  @param[in]  destWidth       The width of the DMA destination. One of
 *                              @ref DL_DMA_WIDTH.
 *  @param[in]  srcIncrement    Amount to increment/decrement the DMA source
 *                              address by. One of @ref DL_DMA_INCREMENT.
 *  @param[in]  destIncrement   Amount to increment/decrement the DMA destination
 *                              address by. One of @ref DL_DMA_INCREMENT.
 */
__STATIC_INLINE void DL_DMA_configTransfer(DMA_Regs *dma, uint8_t channelNum,
    DL_DMA_TRANSFER_MODE transferMode, DL_DMA_EXTENDED_MODE extendedMode,
    DL_DMA_WIDTH srcWidth, DL_DMA_WIDTH destWidth,
    DL_DMA_INCREMENT srcIncrement, DL_DMA_INCREMENT destIncrement)
{
    dma->DMACHAN[channelNum].DMACTL =
        ((uint32_t) transferMode | (uint32_t) extendedMode |
            (((uint32_t) destIncrement) << 4) | (uint32_t) srcIncrement |
            ((uint32_t) destWidth << 4) | (uint32_t) srcWidth);
}

/**
 *  @brief      Configure the DMA for round-robin priority
 *
 *  When round-robin priority is enabled, the channel that completes a transfer
 *  becomes the lowest priority. If multiple triggers happen simultaneously or
 *  are pending, the channel that transferred least recently will transfer
 *  first. Once it's complete the next highest priority channel will transfer.
 *
 *  @param[in]  dma  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_DMA_enableRoundRobinPriority(DMA_Regs *dma)
{
    dma->DMAPRIO |= DMA_DMAPRIO_ROUNDROBIN_ENABLE;
}

/**
 *  @brief      Disable round-robin priority for the DMA
 *
 *  When round-robin priority is disabled, the channel priorities are fixed
 *  in ascending order (Channel 0 is the lowed priority). If multiple triggers
 *  happen simultaneously or are pending, the channel with the highest priority
 *  completes its transfer before the next-highest transfer can start.
 *
 *  @param[in]  dma  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_DMA_disableRoundRobinPriority(DMA_Regs *dma)
{
    dma->DMAPRIO &= ~(DMA_DMAPRIO_ROUNDROBIN_MASK);
}

/**
 *  @brief      Check if round-robin priority is enabled for the DMA
 *
 *  @param[in]  dma  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of round-robin priority
 *
 *  @retval     true  Round-robin priority is enabled
 *  @retval     false Round-robin priority is disabled
 */
__STATIC_INLINE bool DL_DMA_isRoundRobinPriorityEnabled(const DMA_Regs *dma)
{
    return ((dma->DMAPRIO & DMA_DMAPRIO_ROUNDROBIN_MASK) ==
            DMA_DMAPRIO_ROUNDROBIN_ENABLE);
}

/**
 *  @brief      Set the burst size for block transfers
 *
 *  After the DMA transfers the amount of transfers defined by
 *  @ref DL_DMA_BURST_SIZE, the ongoing block transfer is interrupted and the
 *  priority encoder has the chance to assign a higher priority channel. The
 *  previously interrupted block transfer is internally marked as pending and
 *  when no other high priority channel is pending the block transfer will
 *  continue with the next burst or until DMASZ counts down to 0.
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  burstSize     The burst size to set. One of
 *                            @ref DL_DMA_BURST_SIZE.
 *
 *  @sa         DL_DMA_configTransfer
 */
__STATIC_INLINE void DL_DMA_setBurstSize(
    DMA_Regs *dma, DL_DMA_BURST_SIZE burstSize)
{
    DL_Common_updateReg(
        &dma->DMAPRIO, (uint32_t) burstSize, DMA_DMAPRIO_BURSTSZ_MASK);
}

/**
 *  @brief      Get the burst size for block transfers
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *
 *  @return     The burst size for block transfers
 *
 *  @retval     One of @ref DL_DMA_BURST_SIZE
 */
__STATIC_INLINE DL_DMA_BURST_SIZE DL_DMA_getBurstSize(const DMA_Regs *dma)
{
    uint32_t burstSize = dma->DMAPRIO & DMA_DMAPRIO_BURSTSZ_MASK;

    return (DL_DMA_BURST_SIZE)(burstSize);
}

/**
 *  @brief      Enable a DMA channel for transfers
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 */
__STATIC_INLINE void DL_DMA_enableChannel(DMA_Regs *dma, uint8_t channelNum)
{
    dma->DMACHAN[channelNum].DMACTL |= DMA_DMACTL_DMAEN_ENABLE;
}

/**
 *  @brief      Disable a DMA channel for transfers
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 */
__STATIC_INLINE void DL_DMA_disableChannel(DMA_Regs *dma, uint8_t channelNum)
{
    dma->DMACHAN[channelNum].DMACTL &= ~(DMA_DMACTL_DMAEN_MASK);
}

/**
 *  @brief      Check if a DMA channel is enabled for transfers
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The status of the DMA channel
 *
 *  @retval     true  The DMA channel is enabled
 *  @retval     false The DMA channel is disabled
 */
__STATIC_INLINE bool DL_DMA_isChannelEnabled(
    const DMA_Regs *dma, uint8_t channelNum)
{
    return ((dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMAEN_MASK) ==
            DMA_DMACTL_DMAEN_ENABLE);
}

/**
 *  @brief      Configure the mode for a DMA channel
 *
 *  @param[in]  dma          Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum   DMA channel to operate on
 *  @param[in]  transferMode  The transfer mode to set for the channel. Refer to
 *                            the device datasheet to determine which modes are
 *                            supported in the selected channel. One of
 *                            @ref DL_DMA_TRANSFER_MODE.
 *  @param[in]  extendedMode The extended operation mode to set for the
 *                           channel. One of @ref DL_DMA_EXTENDED_MODE.
 *
 *  @sa         DL_DMA_configTransfer
 */
__STATIC_INLINE void DL_DMA_configMode(DMA_Regs *dma, uint8_t channelNum,
    DL_DMA_TRANSFER_MODE transferMode, DL_DMA_EXTENDED_MODE extendedMode)
{
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL,
        (uint32_t) transferMode | (uint32_t) extendedMode,
        DMA_DMACTL_DMATM_MASK | DMA_DMACTL_DMAEM_MASK);
}

/**
 *  @brief      Set a DMA channel's transfer mode
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *  @param[in]  transferMode  The transfer mode to use. Refer to the device
 *                            datasheet to determine which modes are supported
 *                            in the selected channel. One of
 *                            @ref DL_DMA_TRANSFER_MODE.
 *
 *  @sa         DL_DMA_configMode
 *  @sa         DL_DMA_configTransfer
 */
__STATIC_INLINE void DL_DMA_setTransferMode(
    DMA_Regs *dma, uint8_t channelNum, DL_DMA_TRANSFER_MODE transferMode)
{
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL,
        (uint32_t) transferMode, DMA_DMACTL_DMATM_MASK);
}

/**
 *  @brief      Get a DMA channel's transfer mode
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The channel's transfer mode
 *
 *  @retval     One of @ref DL_DMA_TRANSFER_MODE
 */
__STATIC_INLINE DL_DMA_TRANSFER_MODE DL_DMA_getTransferMode(
    const DMA_Regs *dma, uint8_t channelNum)
{
    uint32_t mode = (dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMATM_MASK);

    return (DL_DMA_TRANSFER_MODE)(mode);
}

/**
 *  @brief      Set a DMA channel's extended mode
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *  @param[in]  extendedMode  The transfer mode to use. One of
 *                            @ref DL_DMA_EXTENDED_MODE.
 *
 *  @sa         DL_DMA_configMode
 *  @sa         DL_DMA_configTransfer
 */
__STATIC_INLINE void DL_DMA_setExtendedMode(
    DMA_Regs *dma, uint8_t channelNum, DL_DMA_EXTENDED_MODE extendedMode)
{
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL,
        (uint32_t) extendedMode, DMA_DMACTL_DMAEM_MASK);
}

/**
 *  @brief      Get a DMA channel's extended mode
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The channel's transfer mode
 *
 *  @retval     One of @ref DL_DMA_EXTENDED_MODE
 */
__STATIC_INLINE DL_DMA_EXTENDED_MODE DL_DMA_getExtendedMode(
    const DMA_Regs *dma, uint8_t channelNum)
{
    uint32_t mode = (dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMAEM_MASK);

    return (DL_DMA_EXTENDED_MODE)(mode);
}

/**
 *  @brief      Start a DMA transfer using software
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 */
__STATIC_INLINE void DL_DMA_startTransfer(DMA_Regs *dma, uint8_t channelNum)
{
    dma->DMACHAN[channelNum].DMACTL |= DMA_DMACTL_DMAREQ_REQUEST;
}

/**
 *  @brief      Set a channel's trigger for a DMA transfer
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *  @param[in]  trigger     What should trigger a DMA transfer. Refer to the
 *                          datasheet of the device for which DMA trigger
 *                          values map to which events.
 *  @param[in]  triggerType Whether an internal or external DMA channel is
 *                          selected as the DMA trigger. Refer to the datasheet
 *                          for more information on the DMA channels.
 */
__STATIC_INLINE void DL_DMA_setTrigger(DMA_Regs *dma, uint8_t channelNum,
    uint8_t trigger, DL_DMA_TRIGGER_TYPE triggerType)
{
    DL_Common_updateReg(&dma->DMATRIG[channelNum].DMATCTL,
        trigger | (uint32_t) triggerType,
        DMA_DMATCTL_DMATSEL_MASK | DMA_DMATCTL_DMATINT_MASK);
}

/**
 *  @brief      Get the current trigger for a DMA channel
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     What is configured to trigger a DMA transfer.
 *
 *  @retval     Check the device datasheet for what values are mapped to on
 *              your device.
 */
__STATIC_INLINE uint32_t DL_DMA_getTrigger(
    const DMA_Regs *dma, uint8_t channelNum)
{
    return (dma->DMATRIG[channelNum].DMATCTL & DMA_DMATCTL_DMATSEL_MASK);
}

/**
 *  @brief      Get the current trigger type for a DMA channel
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     Whether an internal or external DMA channel is selected as the
 *              DMA trigger.
 *
 *  @retval     One of @ref DL_DMA_TRIGGER_TYPE
 */
__STATIC_INLINE DL_DMA_TRIGGER_TYPE DL_DMA_getTriggerType(
    const DMA_Regs *dma, uint8_t channelNum)
{
    uint32_t triggerType =
        (dma->DMATRIG[channelNum].DMATCTL & DMA_DMATCTL_DMATINT_MASK);

    return (DL_DMA_TRIGGER_TYPE)(triggerType);
}

/**
 *  @brief      Set a DMA channel's source address
 *
 *  Set the source address for a DMA channel for transferring data from. This
 *  address can be automatically incremented/decremented after the completion
 *  of a transfer by using the @ref DL_DMA_setSrcIncrement function.
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *  @param[in]  srcAddr     Address to set as the DMA source
 *
 *  @sa         DL_DMA_setSrcIncrement
 */
__STATIC_INLINE void DL_DMA_setSrcAddr(
    DMA_Regs *dma, uint8_t channelNum, uint32_t srcAddr)
{
    dma->DMACHAN[channelNum].DMASA = srcAddr;
}

/**
 *  @brief      Get a DMA channel's source address
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     Source address for the DMA channel
 */
__STATIC_INLINE uint32_t DL_DMA_getSrcAddr(
    const DMA_Regs *dma, uint8_t channelNum)
{
    return dma->DMACHAN[channelNum].DMASA;
}

/**
 *  @brief      Set a DMA channel's destination address
 *
 *  Set the destination address for a DMA channel for transferring data to.
 *  This address can be automatically incremented/decremented after the
 *  completion of a transfer by using the @ref DL_DMA_setDestIncrement
 *  function.
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *  @param[in]  destAddr    Address to set as the DMA destination
 *
 *  @sa         DL_DMA_setDestIncrement
 */
__STATIC_INLINE void DL_DMA_setDestAddr(
    DMA_Regs *dma, uint8_t channelNum, uint32_t destAddr)
{
    dma->DMACHAN[channelNum].DMADA = destAddr;
}

/**
 *  @brief      Get a DMA channel's destination address
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     Destination address for the DMA channel
 */
__STATIC_INLINE uint32_t DL_DMA_getDestAddr(
    const DMA_Regs *dma, uint8_t channelNum)
{
    return dma->DMACHAN[channelNum].DMADA;
}

/**
 *  @brief      Set the size of a block for a DMA transfer
 *
 *  Defines the size of the block of data to transfer.
 *
 *  When the transfer mode @ref DL_DMA_TRANSFER_MODE is a Block transfer mode,
 *  this is the size of the block of data transferred every trigger.
 *
 *  When in the transfer mode @ref DL_DMA_TRANSFER_MODE is a Single transfer
 *  mode, this is how many triggers need to occur before the block is considered
 *  done, which then sets the interrupt status.
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *  @param[in]  size          The size of the block of data to transfer. Value
 *                            between 0 - 65535.
 */
__STATIC_INLINE void DL_DMA_setTransferSize(
    DMA_Regs *dma, uint8_t channelNum, uint16_t size)
{
    dma->DMACHAN[channelNum].DMASZ = size;
}

/**
 *  @brief      Get a channel's size of block of data for a DMA transfer
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *
 *  @return     The channel's size of block of data to transfer
 *
 *  @retval     A value between 0 - 65535.
 */
__STATIC_INLINE uint16_t DL_DMA_getTransferSize(
    const DMA_Regs *dma, uint8_t channelNum)
{
    return (uint16_t)(dma->DMACHAN[channelNum].DMASZ & DMA_DMASZ_SIZE_MASK);
}

/**
 *  @brief      Set a channel's source address increment amount
 *
 *  After each DMA transfer the channel source address, which can be set by
 *  @ref DL_DMA_setSrcAddr, can be incremented, decremented or remain
 *  unchanged. This controls if the DMA is copying from a fixed address or a
 *  block of addresses.
 *
 *  The amount that is incremented/decremented is controlled by the width of
 *  the source, set by @ref DL_DMA_setSrcWidth.
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *  @param[in]  srcIncrement  Amount to increment/decrement the DMA source
 *                            address by. One of @ref DL_DMA_INCREMENT.
 *
 *  @sa         DL_DMA_configTransfer
 *  @sa         DL_DMA_setSrcAddr
 *  @sa         DL_DMA_setSrcWidth
 */
__STATIC_INLINE void DL_DMA_setSrcIncrement(
    DMA_Regs *dma, uint8_t channelNum, DL_DMA_INCREMENT srcIncrement)
{
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL,
        (uint32_t) srcIncrement, DMA_DMACTL_DMASRCINCR_MASK);
}

/**
 *  @brief      Return a channel's source address increment amount
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The source address increment amount for selected channel
 *
 *  @retval     One of @ref DL_DMA_INCREMENT.
 */
__STATIC_INLINE DL_DMA_INCREMENT DL_DMA_getSrcIncrement(
    const DMA_Regs *dma, uint8_t channelNum)
{
    uint32_t incrementAmount =
        (dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMASRCINCR_MASK);

