TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1106/driverlib/empty_driverlib_src/ti/driverlib/dl_dma.h
    return (DL_DMA_INCREMENT)(incrementAmount);
}

/**
 *  @brief      Set a channel's destination address increment amount
 *
 *  After each DMA transfer the channel destination address, which can be set by
 *  @ref DL_DMA_setDestAddr, can be incremented, decremented or remain
 *  unchanged. This controls if the DMA is copying from a fixed address or a
 *  block of addresses.
 *
 *  The amount that is incremented/decremented is controlled by the width of
 *  the destination, set by @ref DL_DMA_setDestWidth.
 *
 *  @param[in]  dma           Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum    DMA channel to operate on
 *  @param[in]  destIncrement Amount to increment/decrement the DMA destination
 *                            address by. One of @ref DL_DMA_INCREMENT.
 *
 *  @sa         DL_DMA_configTransfer
 *  @sa         DL_DMA_setDestAddr
 *  @sa         DL_DMA_setDestWidth
 */
__STATIC_INLINE void DL_DMA_setDestIncrement(
    DMA_Regs *dma, uint8_t channelNum, DL_DMA_INCREMENT destIncrement)
{
    /* Left shifted by 4 so the defines align with bitfield */
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL,
        ((uint32_t) destIncrement) << 4, DMA_DMACTL_DMADSTINCR_MASK);
}

/**
 *  @brief      Return a channel's destination address increment amount
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The destination address increment amount for selected channel
 *
 *  @retval     One of @ref DL_DMA_INCREMENT.
 */
__STATIC_INLINE DL_DMA_INCREMENT DL_DMA_getDestIncrement(
    const DMA_Regs *dma, uint8_t channelNum)
{
    /* Right shifted by 4 to align with provided defines */
    uint32_t incrementAmount =
        (dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMADSTINCR_MASK) >> 4;

    return (DL_DMA_INCREMENT)(incrementAmount);
}

/**
 *  @brief      Set the width of the DMA source address for a channel
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *  @param[in]  srcWidth    The width of the DMA source. One of
 *                          @ref DL_DMA_WIDTH.
 *
 *  @sa         DL_DMA_configTransfer
 */
__STATIC_INLINE void DL_DMA_setSrcWidth(
    DMA_Regs *dma, uint8_t channelNum, DL_DMA_WIDTH srcWidth)
{
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL, (uint32_t) srcWidth,
        DMA_DMACTL_DMASRCWDTH_MASK);
}

/**
 *  @brief      Get the width of the DMA source address for a channel
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The width of the DMA source for selected channel
 *
 *  @retval     One of @ref DL_DMA_WIDTH.
 */
__STATIC_INLINE DL_DMA_WIDTH DL_DMA_getSrcWidth(
    const DMA_Regs *dma, uint8_t channelNum)
{
    uint32_t width =
        (dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMASRCWDTH_MASK);

    return (DL_DMA_WIDTH)(width);
}

/**
 *  @brief      Set the width of the DMA destination address for a channel
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *  @param[in]  destWidth   The width of the DMA destination. One of
 *                          @ref DL_DMA_WIDTH.
 *
 *  @sa         DL_DMA_configTransfer
 */
__STATIC_INLINE void DL_DMA_setDestWidth(
    DMA_Regs *dma, uint8_t channelNum, DL_DMA_WIDTH destWidth)
{
    /* Left shifted by 4 to align with provided defines */
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL,
        ((uint32_t) destWidth) << 4, DMA_DMACTL_DMADSTWDTH_MASK);
}

/**
 *  @brief      Get the width of the DMA destination address for a channel
 *
 *  @param[in]  dma         Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The width of the DMA destination for selected channel
 *
 *  @retval     One of @ref DL_DMA_WIDTH.
 */
__STATIC_INLINE DL_DMA_WIDTH DL_DMA_getDestWidth(
    const DMA_Regs *dma, uint8_t channelNum)
{
    /* Right shifted by 4 to align with provided defines */
    uint32_t width =
        (dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMADSTWDTH_MASK) >> 4;

    return (DL_DMA_WIDTH)(width);
}
#ifdef DEVICE_HAS_DMA_FULL_CHANNEL
/**
 *  @brief      Set the early interrupt event.
 *
 *  This functionality is available for FULL-channel configuration only. Please
 *  refer to the device datasheet to map which channels have FULL or BASIC
 *  capability.
 *
 *  The DMA has the capability to generate an early interrupt with a
 *  given amount of transfer cycles before the DMA complete-interrupt is issued.
 *  This allows to start the ISR context switch in parallel with the completion
 *  of the DMA, and compensates the latency for the task switch into the ISR.
 *
 *  Ideally when the ISR starts to execute and read IIDX, the IIDX will already
 *  point to the channel-complete interrupt (always higher priority than the
 *  PRE-IRQ). In this case the latency is minimal and the ISR needs to clear
 *  the PRE-IRQ interrupt flag (RIS) manually.
 *  Should for whatever reason the DMA not complete in time, the IIDX will point
 *  to the PRE-IRQ handler and the handler needs to poll for the DMAEN bit in
 *  the DMA channel control register (DMACTL) to catch the moment that the DMA
 *  transfer has completed. Then the handler needs to clear the DMA
 *  channel-complete IRQ flag manually.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  channelNum     DMA channel to operate on
 *  @param[in]  threshold      When to generate the early interrupt. One of
 *                             @ref DL_DMA_EARLY_INTERRUPT_THRESHOLD.
 */
__STATIC_INLINE void DL_DMA_Full_Ch_setEarlyInterruptThreshold(DMA_Regs *dma,
    uint8_t channelNum, DL_DMA_EARLY_INTERRUPT_THRESHOLD threshold)
{
    DL_Common_updateReg(&dma->DMACHAN[channelNum].DMACTL, (uint32_t) threshold,
        DMA_DMACTL_DMAPREIRQ_MASK);
}

/**
 *  @brief      Get the early interrupt event threshold.
 *
 *  This functionality is available for FULL-channel configuration only. Please
 *  refer to the device datasheet to map which channels have FULL or BASIC
 *  capability.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  channelNum     DMA channel to operate on
 *
 *  @return     The early interrupt event threshold
 *
 *  @retval     One of @ref DL_DMA_EARLY_INTERRUPT_THRESHOLD.
 */
__STATIC_INLINE DL_DMA_EARLY_INTERRUPT_THRESHOLD
DL_DMA_Full_Ch_getEarlyInterruptThreshold(
    const DMA_Regs *dma, uint8_t channelNum)
{
    uint32_t threshold =
        dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMAPREIRQ_MASK;

    return (DL_DMA_EARLY_INTERRUPT_THRESHOLD)(threshold);
}
#endif /* DEVICE_HAS_DMA_FULL_CHANNEL */

/**
 *  @brief      Enable DMA interrupts
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_DMA_enableInterrupt(
    DMA_Regs *dma, uint32_t interruptMask)
{
    dma->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable DMA interrupts
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             @ref DL_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_DMA_disableInterrupt(
    DMA_Regs *dma, uint32_t interruptMask)
{
    dma->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which DMA interrupts are enabled
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_DMA_INTERRUPT.
 *
 *  @return     Which of the requested DMA interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_DMA_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_DMA_getEnabledInterrupts(
    const DMA_Regs *dma, uint32_t interruptMask)
{
    return (dma->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled DMA interrupts
 *
 *  Checks if any of the DMA interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_DMA_INTERRUPT.
 *
 *  @return     Which of the requested DMA interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_DMA_INTERRUPT values
 *
 *  @sa         DL_DMA_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_DMA_getEnabledInterruptStatus(
    const DMA_Regs *dma, uint32_t interruptMask)
{
    return (dma->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any DMA interrupt
 *
 *  Checks if any of the DMA interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_DMA_INTERRUPT.
 *
 *  @return     Which of the requested DMA interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_DMA_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_DMA_getRawInterruptStatus(
    const DMA_Regs *dma, uint32_t interruptMask)
{
    return (dma->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending DMA interrupt
 *
 *  Checks if any of the DMA interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return     The highest priority pending DMA interrupt
 *
 *  @retval     One of @ref DL_DMA_EVENT_IIDX
 */
__STATIC_INLINE DL_DMA_EVENT_IIDX DL_DMA_getPendingInterrupt(
    const DMA_Regs *dma)
{
    return (DL_DMA_EVENT_IIDX) dma->CPU_INT.IIDX;
}

/**
 *  @brief      Clear pending DMA interrupts
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_DMA_clearInterruptStatus(
    DMA_Regs *dma, uint32_t interruptMask)
{
    dma->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief Sets the event publisher channel id
 *
 *  @param[in]  dma     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_DMA_setPublisherChanID(
    DMA_Regs *dma, DL_DMA_PUBLISHER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &dma->FPUB_1;

    *(pReg + (uint32_t) index) = (chanID & DMA_FPUB_1_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel id
 *
 *  @param[in]  dma     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_DMA_getPublisherChanID(
    DMA_Regs *dma, DL_DMA_PUBLISHER_INDEX index)
{
    volatile uint32_t *pReg = &dma->FPUB_1;

    return ((uint8_t)(*(pReg + (uint32_t) index) & DMA_FPUB_1_CHANID_MASK));
}

/**
 *  @brief Sets the event subscriber channel id
 *
 *  @param[in]  dma     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      subscriber is disconnected.
 */
__STATIC_INLINE void DL_DMA_setSubscriberChanID(
    DMA_Regs *dma, DL_DMA_SUBSCRIBER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &dma->FSUB_0;

    *(pReg + (uint32_t) index) = (chanID & DMA_FSUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event subscriber channel id
 *
 *  @param[in]  dma     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *
 *  @return     Event subscriber channel ID
 *
 */
__STATIC_INLINE uint8_t DL_DMA_getSubscriberChanID(
    DMA_Regs *dma, DL_DMA_SUBSCRIBER_INDEX index)
{
    volatile uint32_t *pReg = &dma->FSUB_0;

    return ((uint8_t)(*(pReg + (uint32_t) index) & DMA_FSUB_0_CHANID_MASK));
}

/**
 *  @brief      Enable DMA event
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to enable. Bitwise OR of
 *                             @ref DL_DMA_EVENT.
 */
__STATIC_INLINE void DL_DMA_enableEvent(DMA_Regs *dma, uint32_t eventMask)
{
    dma->GEN_EVENT.IMASK |= (eventMask);
}

/**
 *  @brief      Disable DMA event
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to enable. Bitwise OR of
 *                             @ref DL_DMA_EVENT.
 */
__STATIC_INLINE void DL_DMA_disableEvent(DMA_Regs *dma, uint32_t eventMask)
{
    dma->GEN_EVENT.IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which dma events triggers are enabled
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to check. Bitwise OR of
 *                             @ref DL_DMA_EVENT.
 *
 *  @return     Which of the requested dma events are enabled
 *
 *  @retval     Bitwise OR of @ref DL_DMA_EVENT values
 */
__STATIC_INLINE uint32_t DL_DMA_getEnabledEvents(
    const DMA_Regs *dma, uint32_t eventMask)
{
    return (dma->GEN_EVENT.IMASK & eventMask);
}

/**
 *  @brief      Check event flag of enabled dma event
 *
 *  Checks if any of the dma events that were previously enabled are
 *  pending.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to check. Bitwise OR of
 *                             @ref DL_DMA_EVENT.
 *
 *  @return     Which of the requested dma events are pending
 *
 *  @retval     Bitwise OR of @ref DL_DMA_EVENT values
 *
 *  @sa         DL_DMA_enableEvent
 */
__STATIC_INLINE uint32_t DL_DMA_getEnabledEventStatus(
    const DMA_Regs *dma, uint32_t eventMask)
{
    return (dma->GEN_EVENT.MIS & ~(eventMask));
}

/**
 *  @brief      Check event flag of any dma event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of event to check. Bitwise OR of
 *                             @ref DL_DMA_EVENT.
 *
 *  @return     Which of the requested dma event are pending
 *
 *  @retval     Bitwise OR of @ref DL_DMA_EVENT values
 */
__STATIC_INLINE uint32_t DL_DMA_getRawEventsStatus(
    const DMA_Regs *dma, uint32_t eventMask)
{
    return (dma->GEN_EVENT.RIS & ~(eventMask));
}

/**
 *  @brief      Clear pending dma events
 *
 *  @param[in]  dma            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to clear. Bitwise OR of
 *                             @ref DL_DMA_EVENT.
 */
__STATIC_INLINE void DL_DMA_clearEventsStatus(
    DMA_Regs *dma, uint32_t eventMask)
{
    dma->GEN_EVENT.ICLR |= (eventMask);
}

#ifdef DEVICE_HAS_AUTO_AND_GATHER
/**
 *  @brief      Configure the DMA for auto-enable
 *
 *  @param[in]  dma             Pointer to the register overlay for the peripheral
 *  @param[in]  mode            Enable auto-enable for DMA on a specified register write. One of @ref DL_DMA_AUTOEN
 *  @param[in]  channelNum      DMA channel to operate on
 */
__STATIC_INLINE void DL_DMA_enableAutoEnable(
    DMA_Regs *dma, DL_DMA_AUTOEN mode, uint8_t channelNum)
{
    dma->DMACHAN[channelNum].DMACTL |= mode;
}

/**
 *  @brief      Disable auto-enable for DMA
 *
 *  @param[in]  dma             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  channelNum      DMA channel to operate on
 */
__STATIC_INLINE void DL_DMA_disableAutoEnable(
    DMA_Regs *dma, uint8_t channelNum)
{
    dma->DMACHAN[channelNum].DMACTL &= ~(DMA_DMACTL_DMAAUTOEN_MASK);
}

/**
 *  @brief      Check if auto-enable is enabled for the DMA
 *
 *  @param[in]  dma  Pointer to the register overlay for the peripheral
 *  @param[in]  channelNum  DMA channel to operate on
 *
 *  @return     The status of auto-enable
 *
 *  @retval     true    auto-enable is enabled
 *  @retval     false   auto-enable is disabled
 */
__STATIC_INLINE bool DL_DMA_isAutoEnableEnabled(
    const DMA_Regs *dma, uint8_t channelNum)
{
    return ((dma->DMACHAN[channelNum].DMACTL & DMA_DMACTL_DMAAUTOEN_MASK) !=
            DMA_DMACTL_DMAAUTOEN_DISABLE);
}
#endif /* DEVICE_HAS_AUTO_AND_GATHER*/

#ifdef __cplusplus
}
#endif

#endif /* ti_dl_dl_m0p_dma__include */
/** @}*/
